Autodesk.Revit.DB.Structure.ConstraintToRebarEdgeProperties.GetTargetRebarEdge
Gets the target rebar edge.
Returns:
Returns the target rebar edge.
Since:
2027

Autodesk.Revit.DB.Structure.ConstraintToRebarEdgeProperties.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.ConstraintToRebarEdgeProperties.DistanceToTargetRebar
The distance to the target rebar's edge.
The default value is 0.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for distanceToTargetRebar must be no more than 30000 feet in absolute value.
Since:
2027

Autodesk.Revit.DB.Structure.ConstraintToRebarEdgeProperties.UsePositiveDirectionForZeroOffset
If true, when offset is zero, the child bar is placed in the default positive direction to avoid the clash, false otherwise.
The default value is true.
Since:
2027

Autodesk.Revit.DB.Structure.ConstraintToRebarEdgeProperties.#ctor(Autodesk.Revit.DB.Structure.Rebar,System.Int32)
Constructs a new instance of ConstraintToRebarEdgeProperties.
targetRebar:
The target Rebar
targetEgeIndex:
Identifies the index of the target Rebar's edge.
The index should be between 0 and centerlines.Count - 1, where centerlines are computed by suppressing hooks, cranks and fillets for the first bar in the target set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
targetEgeIndex is not a valid edge index for the rebar. It should be between 0 and centerlines.Count - 1, where centerlines are computed by suppressing hooks, cranks and fillets for the first bar in set.
Since:
2027

Autodesk.Revit.DB.Structure.ConstraintToRebarEdgeProperties.#ctor(Autodesk.Revit.DB.Structure.TargetRebarEdge)
Constructs a new instance of ConstraintToRebarEdgeProperties.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Structure.ConstraintToRebarEdgeProperties
This class is used to access properties for a constraint to a rebar's edge.
Since:
2027